{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.12.0",
  "convertedBy": null,
  "modelTopology": {
    "keras_version": "2.13.1",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "behavior_classifier",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 42],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer"
            },
            "name": "input_layer",
            "inbound_nodes": []
          }
        ]
      }
    },
    "training_config": {
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.001,
          "weight_decay": 0,
          "clipnorm": 0,
          "clipvalue": 0,
          "global_clipnorm": 0,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "trainable": true,
          "dtype": "float32",
          "name": "Adam"
        }
      }
    },
    "weights_manifest": [
      {
        "paths": ["./model.weights.bin"],
        "weights": []
      }
    ]
  }
}
